handlers/product-move-api/src/test/resources/zuoraResponses/GetSubscriptionResponse.json

{
  "success": true,
  "id": "8ad0823f841cf4e601841e61f6aa8923",
  "accountId": "8ad0823f841cf4e601841e61f6aads87",
  "accountNumber": "A00433231",
  "accountName": "accName",
  "invoiceOwnerAccountId": "accId",
  "invoiceOwnerAccountNumber": "accNum",
  "invoiceOwnerAccountName": "accName",
  "subscriptionNumber": "subNum",
  "version": 3,
  "revision": "3.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2022-10-28",
  "serviceActivationDate": "2022-10-28",
  "customerAcceptanceDate": "2022-10-28",
  "subscriptionStartDate": "2022-10-28",
  "subscriptionEndDate": "2023-10-28",
  "lastBookingDate": "2022-10-28",
  "termStartDate": "2022-10-28",
  "termEndDate": "2023-10-28",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 30.00,
  "totalContractedValue": 360.00,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "AcquisitionMetadata__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "LastQSSPaymentDate__c": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "4af94f5f-bc38-4ca9-a22b-113d502222ec",
  "ActivationDate3__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "Suspended__c": "false",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "SuspensionStatus__c": "Active",
  "CardCountry__c": null,
  "CorporateAccountId__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "CancelledBy__c": null,
  "dummy__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "sequenceSetId": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8ad0823f841cf4e601841e61f6d47234",
      "lastChangeType": "Remove",
      "productId": "2c92c0f85a6b134e015a7fcc183e756f",
      "productName": "Contributor",
      "productSku": "SKU-00000049",
      "productRatePlanId": "2c92c0f85a6b134e015a7fcd9f0c7855",
      "ratePlanName": "Monthly Contribution",
      "ratePlanCharges": [
        {
          "id": "8ad0823f841cf4e601841e61f6d98asd",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "2c92c0f85a6b1352015a7fcf35ab397c",
          "number": "C-00732721",
          "name": "Contribution",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 2,
          "pricingSummary": "GBP5",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 5.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2022-10-28",
          "effectiveEndDate": "2022-10-28",
          "processedThroughDate": "2022-10-28",
          "chargedThroughDate": "2022-10-28",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 5.000000000,
          "dmrc": 0.000000000,
          "tcv": 0.000000000,
          "dtcv": -60.000000000,
          "originalOrderDate": "2022-10-28",
          "amendedByOrderOn": "2022-10-28",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    },
    {
      "id": "8ad0823f841cf4e601841e61f6d470bb",
      "lastChangeType": "Add",
      "productId": "8ad09fc281de1ce70181de3b23b2363d",
      "productName": "Supporter Plus",
      "productSku": "SKU-00000072",
      "productRatePlanId": "8ad08cbd8586721c01858804e3275376",
      "ratePlanName": "Supporter Plus Monthly",
      "ratePlanCharges": [
        {
          "id": "id",
          "originalChargeId": "origChgId",
          "productRatePlanChargeId": "8ad09ea0858682bb0185880ac57f4c4c",
          "number": "C-00732747",
          "name": "Supporter Plus Monthly",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP30",
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 30.000000000,
          "tiers": null,
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2022-10-28",
          "effectiveEndDate": "2023-10-28",
          "processedThroughDate": "2022-10-28",
          "chargedThroughDate": "2022-11-28",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 30.000000000,
          "dmrc": 30.000000000,
          "tcv": 360.000000000,
          "dtcv": 360.000000000,
          "originalOrderDate": "2022-10-28",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null
        }
      ],
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null
    }
  ],
  "externallyManagedBy": null
}
