handlers/product-move-api/src/test/resources/zuoraResponses/GetSubscriptionToCancelResponse.json

{
  "success": true,
  "id": "8a12838d8ea33f0f018ea6864aa85328",
  "accountId": "8a12838d8ea33f0f018ea6864a485322",
  "accountNumber": "A02049263",
  "accountName": "001Qv000009AW6IIAW",
  "invoiceOwnerAccountId": "8a12838d8ea33f0f018ea6864a485322",
  "invoiceOwnerAccountNumber": "A02049263",
  "invoiceOwnerAccountName": "001Qv000009AW6IIAW",
  "subscriptionNumber": "A-S02114871",
  "version": 1,
  "revision": "1.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2024-04-04",
  "serviceActivationDate": "2024-04-04",
  "customerAcceptanceDate": "2024-04-04",
  "subscriptionStartDate": "2024-04-04",
  "subscriptionEndDate": "2025-04-04",
  "lastBookingDate": "2024-04-04",
  "termStartDate": "2024-04-04",
  "termEndDate": "2025-04-04",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "USD",
  "contractedMrr": 13.0,
  "totalContractedValue": 156.0,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "cd49cf17-f6b3-dbe4-0000-000000011728",
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "50SPRING2024",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": "50SPRING2024",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": {
    "id": "8a12838d8ea33f0f018ea6864a6f5325",
    "address1": null,
    "address2": null,
    "city": null,
    "country": "United States",
    "county": null,
    "fax": null,
    "state": "North Carolina",
    "postalCode": "27707",
    "firstName": "Test",
    "lastName": "User",
    "nickname": null,
    "workEmail": "test@thegulocal.com",
    "personalEmail": null,
    "homePhone": null,
    "mobilePhone": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "taxRegion": null,
    "workPhone": null,
    "contactDescription": null,
    "Company_Name__c": null,
    "SpecialDeliveryInstructions__c": null,
    "Title__c": null
  },
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": {
    "id": "8a12838d8ea33f0f018ea6864a6f5325",
    "address1": null,
    "address2": null,
    "city": null,
    "country": "United States",
    "county": null,
    "fax": null,
    "state": "North Carolina",
    "postalCode": "27707",
    "firstName": "Test",
    "lastName": "User",
    "nickname": null,
    "workEmail": "test@thegulocal.com",
    "personalEmail": null,
    "homePhone": null,
    "mobilePhone": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "taxRegion": null,
    "workPhone": null,
    "contactDescription": null,
    "Company_Name__c": null,
    "SpecialDeliveryInstructions__c": null,
    "Title__c": null
  },
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a12838d8ea33f0f018ea6864ab6532a",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0ff5345f9220153559d915d5c26",
      "productRatePlanNumber": "PRP-00000048",
      "ratePlanName": "Percentage",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05214077",
      "ratePlanCharges": [
        {
          "id": "8a12838d8ea33f0f018ea6864ac9532e",
          "originalChargeId": "8a12838d8ea33f0f018ea6864ac9532e",
          "productRatePlanChargeId": "2c92a0fd5345efa10153559e97bb76c6",
          "number": "C-05449866",
          "name": "Percentage",
          "productRatePlanChargeNumber": "PRPC-00000044",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "USD",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-04-04",
          "effectiveEndDate": "2024-10-04",
          "processedThroughDate": "2024-05-04",
          "chargedThroughDate": "2024-06-04",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 6,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2024-04-04",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "50%  discount",
          "price": null,
          "discountAmount": null,
          "discountPercentage": 50.0
        }
      ]
    },
    {
      "id": "8a12838d8ea33f0f018ea6864ad5532f",
      "productId": "8a12865b8219d9b4018221061563643f",
      "productName": "Supporter Plus",
      "productSku": "ABC-00000032",
      "productRatePlanId": "8a128ed885fc6ded018602296ace3eb8",
      "productRatePlanNumber": "PRP-00000180",
      "ratePlanName": "Supporter Plus V2 - Monthly",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-05214078",
      "ratePlanCharges": [
        {
          "id": "8a12838d8ea33f0f018ea6864af85336",
          "originalChargeId": "8a12838d8ea33f0f018ea6864af85336",
          "productRatePlanChargeId": "8a128ed885fc6ded018602296af13eba",
          "number": "C-05449868",
          "name": "Supporter Plus Monthly Charge",
          "productRatePlanChargeNumber": "PRPC-00000280",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "USD",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-04-04",
          "effectiveEndDate": "2025-04-04",
          "processedThroughDate": "2024-05-04",
          "chargedThroughDate": "2024-06-04",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 13.0,
          "dmrc": 13.0,
          "tcv": 156.0,
          "dtcv": 156.0,
          "originalOrderDate": "2024-04-04",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "USD13",
          "price": 13.0,
          "discountAmount": null,
          "discountPercentage": null
        },
        {
          "id": "8a12838d8ea33f0f018ea6864aef5335",
          "originalChargeId": "8a12838d8ea33f0f018ea6864aef5335",
          "productRatePlanChargeId": "8a128d7085fc6dec01860234cd075270",
          "number": "C-05449867",
          "name": "Contribution",
          "productRatePlanChargeNumber": "PRPC-00000281",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "USD",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.0,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-04-04",
          "effectiveEndDate": "2025-04-04",
          "processedThroughDate": "2024-05-04",
          "chargedThroughDate": "2024-06-04",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 0.0,
          "dmrc": 0.0,
          "tcv": 0.0,
          "dtcv": 0.0,
          "originalOrderDate": "2024-04-04",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "USD0",
          "price": 0.0,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2024-04-04",
      "endDate": "2025-04-04",
      "status": "Active"
    },
    {
      "startDate": "2025-04-04",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2024-04-04 01:33:22",
  "updateTime": "2024-05-04 04:09:57"
}
